Catalogs/ФССП_ИсполнительноеПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ФССП_ИсполнительноеПроизводство</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерИД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолговоеОбязательствоИП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СПИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеВыезда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветчикФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозбуждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ФССП_СостояниеИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ФССП_СостояниеИП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>bailiff</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>department</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>subject</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ip_end</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>exe_production</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>details</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФССП_СтатусыИП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтделСудебныхПриставов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_СлужбыСудебныхПриставов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СудебныйПриставИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СудебныеПриставы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОкончания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предмет1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предмет2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предмет3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерИД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВозбуждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ФССП_ЗадолженностьПоПредметамИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ФССП_ЗадолженностьПоПредметамИП</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФССП_ВидДвиженияЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПлатеж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсполнительноеПроизводство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ФССП_СтатусыИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ФССП_СтатусыИП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действующее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОконченоИсполнением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОконченоБезИсполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утерян</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтзывИД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОбновлениеИсполнительногоПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ОбновлениеИсполнительногоПроизводства</Name>
			<BasedOn>
				<xr:Item>Catalog.ФССП_ИсполнительноеПроизводство</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ФССП_СостояниеИП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсполнительноеПроизводство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФССП_СтатусыИП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделСудебныхПриставов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_СлужбыСудебныхПриставов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйПриставИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СудебныеПриставы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОкончания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозбуждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ФССП_ИсполнительноеПроизводство/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФССП_СостояниеИПСрезПоследних.СтатусИП КАК СтатусИП,
		|	ФССП_СостояниеИПСрезПоследних.ОтделСудебныхПриставов КАК ОтделСудебныхПриставов,
		|	ФССП_СостояниеИПСрезПоследних.СудебныйПриставИсполнитель КАК СудебныйПриставИсполнитель,
		|	ФССП_СостояниеИПСрезПоследних.ПричинаОкончания КАК ПричинаОкончания,
		|	ФССП_СостояниеИПСрезПоследних.ДатаОкончания КАК ДатаОкончания,
		|	ФССП_СостояниеИПСрезПоследних.ДатаВозбуждения КАК ДатаВозбуждения,
		|	ФССП_СостояниеИПСрезПоследних.НомерСД КАК НомерСД
		|ИЗ
		|	РегистрСведений.ФССП_СостояниеИП.СрезПоследних(, ИП = &ИП) КАК ФССП_СостояниеИПСрезПоследних";
		
		Запрос.УстановитьПараметр("ИП", Объект.Ссылка);
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда	
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Результат);	
		КонецЕсли;
		
		ЗапросОстатки = Новый Запрос;
		
		ЗапросОстатки.Текст = 
		"ВЫБРАТЬ
		|	ФССП_ЗадолженностьПоПредметамИПОстатки.Предмет КАК Предмет,
		|	ФССП_ЗадолженностьПоПредметамИПОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ФССП_ЗадолженностьПоПредметамИП.Остатки(, ИсполнительноеПроизводство = &ИП) КАК ФССП_ЗадолженностьПоПредметамИПОстатки";
		
		ЗапросОстатки.УстановитьПараметр("ИП", Объект.Ссылка);
		
		РезультатЗапроса = ЗапросОстатки.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		к = 1;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Пред"+к+"", Тип("ДекорацияФормы"),ЭтотОбъект.Элементы.СостояниеИсполнительногоПроизводства);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = Строка(ВыборкаДетальныеЗаписи.Предмет.Наименование) + ":";
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Сум"+к+"", Тип("ДекорацияФормы"),ЭтотОбъект.Элементы.СостояниеИсполнительногоПроизводства);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = ВыборкаДетальныеЗаписи.СуммаОстаток;
            к = к + 1;
		КонецЦикла;
		
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	ОтветчикПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФССП_СостояниеИПСрезПоследних.Период КАК Период,
	                      |	ФССП_СостояниеИПСрезПоследних.Регистратор КАК Регистратор,
	                      |	ФССП_СостояниеИПСрезПоследних.НомерСтроки КАК НомерСтроки,
	                      |	ФССП_СостояниеИПСрезПоследних.Активность КАК Активность,
	                      |	ФССП_СостояниеИПСрезПоследних.ИП КАК ИсполнительноеПроизводство,
	                      |	ФССП_СостояниеИПСрезПоследних.bailiff КАК bailiff,
	                      |	ФССП_СостояниеИПСрезПоследних.department КАК department,
	                      |	ФССП_СостояниеИПСрезПоследних.name КАК name,
	                      |	ФССП_СостояниеИПСрезПоследних.subject КАК subject,
	                      |	ФССП_СостояниеИПСрезПоследних.ip_end КАК ip_end,
	                      |	ФССП_СостояниеИПСрезПоследних.exe_production КАК exe_production,
	                      |	ФССП_СостояниеИПСрезПоследних.details КАК details,
	                      |	ФССП_СостояниеИПСрезПоследних.СтатусИП КАК СтатусИП,
	                      |	ФССП_СостояниеИПСрезПоследних.Завершено КАК Завершено,
	                      |	ФССП_СостояниеИПСрезПоследних.ОтделСудебныхПриставов КАК ОтделСудебныхПриставов,
	                      |	ФССП_СостояниеИПСрезПоследних.СудебныйПриставИсполнитель КАК СудебныйПриставИсполнитель,
	                      |	ФССП_СостояниеИПСрезПоследних.ПричинаОкончания КАК ПричинаОкончания,
	                      |	ФССП_СостояниеИПСрезПоследних.ДатаОкончания КАК ДатаОкончания,
	                      |	ФССП_СостояниеИПСрезПоследних.Предмет1 КАК Предмет1,
	                      |	ФССП_СостояниеИПСрезПоследних.Сумма1 КАК Сумма1,
	                      |	ФССП_СостояниеИПСрезПоследних.Предмет2 КАК Предмет2,
	                      |	ФССП_СостояниеИПСрезПоследних.Сумма2 КАК Сумма2,
	                      |	ФССП_СостояниеИПСрезПоследних.Предмет3 КАК Предмет3,
	                      |	ФССП_СостояниеИПСрезПоследних.Сумма3 КАК Сумма3,
	                      |	ФССП_СостояниеИПСрезПоследних.НомерИД КАК НомерИД,
	                      |	ФССП_СостояниеИПСрезПоследних.НомерСД КАК НомерСД,
	                      |	ФССП_СостояниеИПСрезПоследних.ДатаВозбуждения КАК ДатаВозбуждения
	                      |ИЗ
	                      |	РегистрСведений.ФССП_СостояниеИП.СрезПоследних КАК ФССП_СостояниеИПСрезПоследних
	                      |ГДЕ
	                      |	ФССП_СостояниеИПСрезПоследних.ИП = &ИП");
	Запрос.УстановитьПараметр("ИП", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Если Результат.СтатусИП <> СтатусИП 
			ИЛИ Результат.ОтделСудебныхПриставов <> ОтделСудебныхПриставов 
			ИЛИ Результат.СудебныйПриставИсполнитель <> СудебныйПриставИсполнитель 
			ИЛИ Результат.ПричинаОкончания <> ПричинаОкончания
			ИЛИ Результат.ДатаОкончания <> ДатаОкончания
			ИЛИ Результат.ДатаВозбуждения <> ДатаВозбуждения
			ИЛИ Результат.НомерСД <> НомерСД Тогда
			ОбновитьСостояниеИП();
		КонецЕсли;	
	Иначе
		Если ЗначениеЗаполнено(СтатусИП)
			ИЛИ ЗначениеЗаполнено(ОтделСудебныхПриставов) 
			ИЛИ ЗначениеЗаполнено(СудебныйПриставИсполнитель) 
			ИЛИ ЗначениеЗаполнено(ПричинаОкончания)
			ИЛИ ЗначениеЗаполнено(ДатаОкончания)
			ИЛИ ЗначениеЗаполнено(ДатаВозбуждения)
			ИЛИ ЗначениеЗаполнено(НомерСД) Тогда
			ОбновитьСостояниеИП();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеИП()
	ДокументОбъект = Документы.ОбновлениеИсполнительногоПроизводства.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ЭтаФорма);
	ДокументОбъект.Завершено = (СтатусИП = Перечисления.ФССП_СтатусыИП.ОконченоБезИсполнения ИЛИ СтатусИП = Перечисления.ФССП_СтатусыИП.ОконченоИсполнением);
	ДокументОбъект.НомерИД = Объект.НомерИД;
	ДокументОбъект.ИсполнительноеПроизводство = Объект.Ссылка;
	ДокументОбъект.Должник = Объект.Владелец;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновлениеИП");
КонецПроцедуры

&НаСервере
Процедура ОтветчикПриИзмененииНаСервере()
	Объект.ОтветчикФИО = Объект.Владелец.ФИО_Действующее;
	Элементы.ОтветчикФИО.СписокВыбора.Очистить();
	Для Каждого ФИО из Объект.Владелец.ФИО Цикл
		стр = Элементы.ОтветчикФИО.СписокВыбора.Добавить();
		стр.Значение = ФИО.ФИО;
		стр.Представление = ФИО.ФИО;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ОтветчикПриИзменении(Элемент)
	ОтветчикПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//Элементы.ОтветчикФИО.СписокВыбора.Очистить();
	//Для Каждого ФИО из Объект.Владелец.ФИО Цикл
	//	стр = Элементы.ОтветчикФИО.СписокВыбора.Добавить();
	//	стр.Значение = ФИО.ФИО;
	//	стр.Представление = ФИО.ФИО;
	//КонецЦикла;
КонецПроцедуры
